app/controllers/manager_controller.rb

  def dianyuan
    if params[:DYMC].nil? || params[:DYMC].strip == ""
      @dianyuan_account = Dianyuan.all.size
      @Dianyuans = Dianyuan.paginate(page:params[:page],per_page:10)
      @current_page = params[:page] == nil ? 1 : params[:page]
      render "dianyuan"
    else
      dymc = params[:DYMC].strip
      result_dianyuans = Dianyuan.where("DYMC LIKE '%#{dymc}%'")
---
SELECT COUNT(*) FROM `dianyuans` WHERE (DYMC LIKE '%(甲）丁佐军%')
SELECT `dianyuans`.* FROM `dianyuans` WHERE (DYMC LIKE '%(甲）丁佐军%')
SELECT  `dianyuans`.* FROM `dianyuans` WHERE (DYMC LIKE '%(甲）丁佐军%') LIMIT 10 OFFSET 0
SELECT  `dianyuans`.* FROM `dianyuans` WHERE `dianyuans`.`DYMC` = '' LIMIT 1

  def synchronizeDianyuan
    if(get(DIANYUAN_INFO_URL).nil?)
      redirect_to manager_dianyuan_path
    else
      dianyuansObj = JSON.parse(get(DIANYUAN_INFO_URL).to_s)
      dianyuansObj.each do |dianyuan|
        if Dianyuan.find_by_DYDM(dianyuan["DYDM"]).nil?
---
SELECT  `dianyuans`.* FROM `dianyuans` WHERE `dianyuans`.`DYDM` = '0' LIMIT 1

            new_dianyuan.ZJF = dianyuan["ZJF"]
          end

          new_dianyuan.save
---
INSERT INTO `dianyuans` (`BYZD1`, `BYZD3`, `BYZD4`, `BZ`, `DYDM`, `DYMC`, `DYXB`, `KHDM`, `QDDM`, `QMM`, `XZDM`, `ZDZK`, `created_at`, `updated_at`) VALUES ('0', '0', '1.0000', '0.8到11。3收', 'LUM', '刘玉梅', '0', '027001', '000', '', '0', '1.0000', '2016-10-31 01:55:00', '2016-10-31 01:55:00')