app/controllers/welcome_controller.rb

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @store = Store.find(params[:storeid])

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", nil]]
---
  def navigate
    @store = Store.find(params[:storeid])