app/controllers/welcome_controller.rb

SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @store = Store.find(params[:storeid])